//============================================================================
// 
// 3Dブロック、ヘッダファイル [block3D.h]
// Author : 福田歩希
// 
//============================================================================

#ifndef _BLOCK3D_H_
#define _BLOCK3D_H_	// 二重インクルード防止

//****************************************************
// インクルードファイル
//****************************************************
#include "objectX.h"

//****************************************************
// 3Dブロッククラス
//****************************************************
class CBlock3D : public CObjectX
{
public:

	CBlock3D();				// コンストラクタ
	~CBlock3D() override;	// デストラクタ

	HRESULT Init() override;	// 初期設定
	void Uninit() override;		// 終了処理
	void Update() override;		// 更新処理
	void Draw() override;		// 描画処理

	static CBlock3D* Create(D3DXVECTOR3 pos);	// 生成
};

#endif // _BLOCK3D_H_