////============================================================================
//// 
//// FBXモデル、ヘッダファイル [modelFBX.h]
//// Author : 福田歩希
//// 
////============================================================================
//
//#ifndef _MODELFBX_H_
//#define _MODELFBX_H_	// 二重インクルード防止
//
////****************************************************
//// インクルードファイル
////****************************************************
//#include "main.h"
//
////****************************************************
//// FBXモデル管理クラス
////****************************************************
//class CModelFBX
//{
//public:
//
//	//****************************************************
//	// モデル識別
//	//****************************************************
//	enum class MODEL_TYPE
//	{
//		MODEL_TEST = 0,	// テスト
//		MAX,
//	};
//
//	//****************************************************
//	// FBXモデル情報の構造体
//	//****************************************************
//	struct MODEL_FBX
//	{
//
//	};
//
//	CModelFBX();	// コンストラクタ
//	~CModelFBX();	// デストラクタ
//
//	HRESULT Load();	// モデル読込
//	void Unload();	// モデル破棄
//
//	CModelFBX* GetModel(MODEL_TYPE type);	// モデルを取得
//
//private:
//
//	static MODEL_FBX m_aModelTemp[static_cast<int>(MODEL_TYPE::MAX)];	// モデル管理
//};
//
//#endif // _MODELFBX_H_