////============================================================================
//// 
//// ステージ作成 [stagemaker.cpp]
//// Author : 福田歩希
//// 
////============================================================================
//
//#ifndef _SATEGEMAKER_H_
//#define _SATEGEMAKER_H_	// 二重インクルード防止
//
////****************************************************
//// インクルードファイル
////****************************************************}
//#include "object.h"
//
////****************************************************
//// ステージ作成クラス
////****************************************************
//class CStageMaker
//{
//public:
//
//	CStageMaker();	// コンストラクタ
//	~CStageMaker();	// デストラクタ
//
//	HRESULT Init();	// 初期設定
//	void Uninit();	// 終了処理
//	void Update();	// 更新処理
//	void Draw();	// 描画処理
//
//private:
//
//	void SetType();	// 種類の変更
//	void Control();	// 操作
//
//	CObject* m_PreObject;	// 仮想オブジェクト
//	D3DXVECTOR3 m_pos;		// 位置
//};
//
//#endif // _SATEGEMAKER_H_