//============================================================================
// 
// 地面、ヘッダファイル [field.h]
// Author : 福田歩希
// 
//============================================================================

#ifndef _FIELD_H_
#define _FIELD_H_	// 二重インクルード防止

//****************************************************
// インクルードファイル
//****************************************************
#include "object3D.h"

//****************************************************
// フィールドクラス
//****************************************************
class CField : public CObject3D
{
public:

	CField();			// コンストラクタ
	~CField() override;	// デストラクタ

	HRESULT Init() override;	// 初期設定
	void Uninit() override;		// 終了処理
	void Update() override;		// 更新処理
	void Draw() override;		// 描画処理

	static CField* Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// 生成
};

#endif // _FIELD_H_