//============================================================================
// 
// Xオブジェクト管理 [objectX.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "objectX.h"
#include "main.h"
#include "manager.h"

//============================================================================
// コンストラクタ
//============================================================================
CObjectX::CObjectX(int nPriority) : CObject(nPriority)
{
	m_pModel = nullptr;					// モデル情報
	m_pos = { 0.0f, 0.0f, 0.0f };		// 中心位置
	m_rot = { 0.0f, 0.0f, 0.0f };		// 向き
	D3DXMatrixIdentity(&m_mtxWorld);	// ワールド行列
}

//============================================================================
// デストラクタ
//============================================================================
CObjectX::~CObjectX()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CObjectX::Init()
{
	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CObjectX::Uninit()
{

}

//============================================================================
// 更新処理
//============================================================================
void CObjectX::Update()
{
	// ワールド行列の設定
	SetMtxWorld();
}

//============================================================================
// 描画処理
//============================================================================
void CObjectX::Draw()
{
	// デバイスを取得
	LPDIRECT3DDEVICE9 pDev = CManager::GetRenderer()->GetDeviece();

	// 現在のマテリアル保存用
	D3DMATERIAL9 matDef;

	// マテリアル情報へのポインタ
	D3DXMATERIAL* pMat = nullptr;

	// ワールドマトリックスの設定
	pDev->SetTransform(D3DTS_WORLD, &m_mtxWorld);

	// 現在のマテリアルを取得
	pDev->GetMaterial(&matDef);

	// マテリアルデータへのポインタを取得
	pMat = (D3DXMATERIAL*)m_pModel->pBuffMat->GetBufferPointer();

	for (int nCntMat = 0; nCntMat < static_cast<int>(m_pModel->dwNumMat); nCntMat++)
	{
		// マテリアルの設定
		pDev->SetMaterial(&pMat[nCntMat].MatD3D);

		// テクスチャの設定
		pDev->SetTexture(0, m_pModel->ppTex[nCntMat]);

		// オブジェクトパーツの描画
		m_pModel->pMesh->DrawSubset(nCntMat);
	}

	// 保存していたマテリアルを戻す
	pDev->SetMaterial(&matDef);
}

//============================================================================
// モデル割当
//============================================================================
void CObjectX::BindModel(MODEL* pModel)
{
	if (pModel->pMesh == nullptr)
	{ // 取得失敗
		assert(false);
	}

	m_pModel = pModel;
}

//============================================================================
// 中心位置取得
//============================================================================
D3DXVECTOR3 CObjectX::GetPos()
{
	return m_pos;
}

//============================================================================
// 中心位置設定
//============================================================================
void CObjectX::SetPos(D3DXVECTOR3 pos)
{
	m_pos = pos;
}

//============================================================================
// 向き取得
//============================================================================
D3DXVECTOR3 CObjectX::GetRot()
{
	return m_rot;
}

//============================================================================
// 向き設定
//============================================================================
void CObjectX::SetRot(D3DXVECTOR3 rot)
{
	m_rot = rot;
}

//============================================================================
// 生成
//============================================================================
CObjectX* CObjectX::Create()
{
	CObjectX* pObjectX = new CObjectX;

	// 生成出来ていたら初期設定
	if (pObjectX != nullptr)
	{
		pObjectX->Init();
	}

	return pObjectX;
}

//============================================================================
// ワールド行列設定
//============================================================================
void CObjectX::SetMtxWorld()
{
	// 計算用行列
	D3DXMATRIX mtxRot, mtxTrans;

	// ワールド行列を初期化
	D3DXMatrixIdentity(&m_mtxWorld);

	// 回転行列作成
	D3DXMatrixRotationYawPitchRoll(&mtxRot,
		m_rot.y,
		m_rot.x,
		m_rot.z);

	// 回転行列との掛け算
	D3DXMatrixMultiply(&m_mtxWorld,
		&m_mtxWorld,
		&mtxRot);

	// 平行移動行列作成
	D3DXMatrixTranslation(&mtxTrans,
		m_pos.x,
		m_pos.y,
		m_pos.z);

	// 平行移動行列との掛け算
	D3DXMatrixMultiply(&m_mtxWorld,
		&m_mtxWorld,
		&mtxTrans);
}